app/views/posts/_form.html.erb

SELECT 1 FROM `categories` INNER JOIN `categories_posts` ON `categories`.`id` = `categories_posts`.`category_id` WHERE `categories_posts`.`post_id` IS NULL AND `categories`.`id` = 1 LIMIT 1
---
		<label>
		<%= check_box_tag "post[category][]", category.id, @post.categories.include?(category) %>