app/views/posts/show.html.erb

SELECT COUNT(*) FROM `comments` WHERE `comments`.`post_id` = 1
---
<div id='comments'>
<% if @post.comments.any? %>