app/controllers/comments_controller.rb

	def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.build(params[:comment])

    unless @comment.save
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
INSERT INTO `comments` (`author`, `body`, `created_at`, `email`, `post_id`, `updated_at`, `url`) VALUES ('eu', 'eeeee', '2012-04-11 19:50:02', 'doglas@hotmail.com', 3, '2012-04-11 19:50:02', 'http://teste.com')