app/controllers/posts_controller.rb

  def show
    @post = Post.find(params[:id])
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1

  def edit
    @post = Post.find(params[:id])
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 2 LIMIT 1

  def create
    @post = Post.new(params[:post])

    if @post.save
---
INSERT INTO `posts` (`body`, `created_at`, `excerpt`, `title`, `updated_at`) VALUES ('and body', '2012-04-10 19:59:57', 'com excerpt', 'Firts Post', '2012-04-10 19:59:57')

  def update
    @post = Post.find(params[:id])


	  if @post.update_attributes(params[:post])
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 2 LIMIT 1
UPDATE `posts` SET `title` = 'second', `excerpt` = 'with excerpt', `updated_at` = '2012-04-11 17:07:08' WHERE `posts`.`id` = 1

	def load_resources
		@authors = User.all
		@categories = Category.all
---
SELECT `users`.* FROM `users`
SELECT `categories`.* FROM `categories`